function dotsdfAndBoxes(ar) {
    // количество квадратов по ширине и высоте для 12 рёбер 2
    const res = Math.sqrt(ar.length / 2 + 0.25) - 0.5;
    console.log(res)
    return ar
        .map(([x,y]) => [Math.min(x, y), Math.max(x, y)])
        .reduce((a, [b, c]) => {
                a.grid[b]++;
                // если текущие ребро - горизонтальное (b + 1 === c), тогда
                // res1 = [-3..5]
                // иначе res1 = [-1..7]

                const res1 = (b + 1 === c) ? b - res - 1 : b - 1;

                // только если ребро внутреннее, res1 будет неотрицательным индексом
                a.grid[res1]++;

                // если узел был использован 4 раза, то квадрат образован
                a.isFirst = (a.grid[b] === 4 || a.grid[res1] === 4) ? a.isFirst : !a.isFirst;
                // обновление счёта
                a.score[a.isFirst ? 0 : 1] += (a.grid[b] === 4) + (a.grid[res1] === 4);
                return a;
            },{
                score: [0, 0],
                isFirst: true,
                grid: new Array((res + 1) ** 2).fill(0)
            }
        ).score;
}

const example_tests = [
    [[0,1],[7,8],[1,2],[6,7],[0,3],[5,8],[3,4],[1,4],[4,5],[2,5],[4,7],[3,6]],
    [[0,1],[1,2],[2,5],[5,4],[4,7],[7,8],[8,5],[1,4],[6,7],[3,6],[3,0],[3,4]],
    [[0,1],[7,8],[1,2],[6,7],[0,3],[8,5],[3,4],[4,1],[4,5],[2,5],[3,6],[7,4]],
    [[0, 1], [5, 9], [9, 8], [13, 9], [7, 11], [0, 4], [9, 10], [10, 6], [4, 5], [2, 3], [13, 14], [4, 8], [8, 12], [1, 5], [5, 6], [14, 15], [10, 11], [2, 6], [12, 13], [1, 2], [10, 14], [15, 11], [6, 7], [3, 7]],
    [[5, 9], [6, 10], [9, 13], [7, 11], [4, 5], [5, 6], [6, 7], [8, 12], [1, 5], [2, 6], [8, 9], [10, 14], [10, 11], [4, 8], [12, 13], [9, 10], [1, 2], [11, 15], [13, 14], [14, 15], [0, 4], [0, 1], [3, 7], [2, 3]],
    [[5,6],[12,17],[16,21],[13,14],[2,7],[5,10],[13,18],[17,18],[10,11],[15,20],[21,22],[1,6],[7,8],[10,15],[15,16],[8,3],[18,23],[0,5],[6,7],[8,13],[11,12],[11,16],[22,23],[17,22],[20,21],[6,11],[16,17],[0,1],[7,12],[12,13],[2,3],[14,19],[23,24],[1,2],[8,9],[19,24],[18,19],[9,14],[4,9],[3,4]]
];
const example_solutions = [[3, 1], [2, 2], [1, 3], [2, 7], [6, 3]];

example_tests.forEach((v) => console.log(dotsdfAndBoxes(v)));
